Terraform Plan:

```
module.data_ingester.random_string.resource_code: Refreshing state... [id=p3sha]
module.data_ingester.data.azurerm_client_config.current: Reading...
module.data_ingester.azurerm_resource_group.tfstate: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics]
module.data_ingester.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iN2VjMGExZC1hZjAyLTQ2YzUtOTdkMS05MDBkNGUzMmNmOTM7b2JqZWN0SWQ9YjdlY2YxYWUtYzE0Zi00YmU4LWE4ZDEtZGI3YjUxNTdkNWQ5O3N1YnNjcmlwdGlvbklkPTMyNTkxZjIyLTgyMDktNGM4Mi1hNjVjLTYxOGI5NjdlN2JmZjt0ZW5hbnRJZD05YzdkOWRkMy04NDBjLTRiM2YtODE4ZS01NTI4NjUwODJlMTY=]
module.data_ingester.azurerm_service_plan.SSPHP_rust: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/serverFarms/SSPHP-Metrics_rust-p3sha]
module.data_ingester.azurerm_application_insights.SSPHP: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Insights/components/SSPHP-Metrics]
module.data_ingester.azurerm_storage_account.tfstate: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Storage/storageAccounts/tfstatep3sha]
module.data_ingester.azurerm_storage_container.tfstate: Refreshing state... [id=https://tfstatep3sha.blob.core.windows.net/tfstate]
module.data_ingester.azurerm_linux_function_app.SSPHP_rust: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-p3sha]
module.data_ingester.azurerm_key_vault.SSPHP: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.KeyVault/vaults/SSPHP-Metrics]
module.data_ingester.azurerm_key_vault_certificate.example: Refreshing state... [id=https://ssphp-metrics.vault.azure.net/certificates/ad-client-certificate/f824d238855648b581f1a3840c3e7286]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.data_ingester.data.archive_file.data_ingester_rust will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "data_ingester_rust" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../data_ingester/../../data_ingester_workspace/data_ingester_axum_entrypoint/function_zip/"
      + type                = "zip"
    }

  # module.data_ingester.azurerm_linux_function_app.SSPHP_rust will be updated in-place
  ~ resource "azurerm_linux_function_app" "SSPHP_rust" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY" = (sensitive value)
            # (4 unchanged elements hidden)
        }
        id                                             = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-p3sha"
        name                                           = "SSPHP-Metrics-rust-p3sha"
      ~ tags                                           = {
            "Environment"                                    = "Dev"
            "Product"                                        = "Protective Monitoring - Splunk SaaS"
            "Service Offering"                               = "Protective Monitoring - Splunk SaaS"
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=fa7ff01b-8fda-41c2-ac15-c616a7d6e4d4;IngestionEndpoint=https://westeurope-2.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=042c0014-747c-4927-be3b-74cbf748f850" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "fa7ff01b-8fda-41c2-ac15-c616a7d6e4d4" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/microsoft.insights/components/SSPHP-Metrics" -> null
        }
      ~ zip_deploy_file                                = "../data_ingester/data_ingester_rust_20241015102633.zip" -> (known after apply)
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
stdout<<ghadelimiter_2ed1518f-7dc2-487b-8ba9-026440664981
module.data_ingester.random_string.resource_code: Refreshing state... [id=p3sha]
module.data_ingester.data.azurerm_client_config.current: Reading...
module.data_ingester.azurerm_resource_group.tfstate: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics]
module.data_ingester.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iN2VjMGExZC1hZjAyLTQ2YzUtOTdkMS05MDBkNGUzMmNmOTM7b2JqZWN0SWQ9YjdlY2YxYWUtYzE0Zi00YmU4LWE4ZDEtZGI3YjUxNTdkNWQ5O3N1YnNjcmlwdGlvbklkPTMyNTkxZjIyLTgyMDktNGM4Mi1hNjVjLTYxOGI5NjdlN2JmZjt0ZW5hbnRJZD05YzdkOWRkMy04NDBjLTRiM2YtODE4ZS01NTI4NjUwODJlMTY=]
module.data_ingester.azurerm_service_plan.SSPHP_rust: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/serverFarms/SSPHP-Metrics_rust-p3sha]
module.data_ingester.azurerm_application_insights.SSPHP: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Insights/components/SSPHP-Metrics]
module.data_ingester.azurerm_storage_account.tfstate: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Storage/storageAccounts/tfstatep3sha]
module.data_ingester.azurerm_storage_container.tfstate: Refreshing state... [id=https://tfstatep3sha.blob.core.windows.net/tfstate]
module.data_ingester.azurerm_linux_function_app.SSPHP_rust: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-p3sha]
module.data_ingester.azurerm_key_vault.SSPHP: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.KeyVault/vaults/SSPHP-Metrics]
module.data_ingester.azurerm_key_vault_certificate.example: Refreshing state... [id=https://ssphp-metrics.vault.azure.net/certificates/ad-client-certificate/f824d238855648b581f1a3840c3e7286]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.data_ingester.data.archive_file.data_ingester_rust will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "data_ingester_rust" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../data_ingester/../../data_ingester_workspace/data_ingester_axum_entrypoint/function_zip/"
      + type                = "zip"
    }

  # module.data_ingester.azurerm_linux_function_app.SSPHP_rust will be updated in-place
  ~ resource "azurerm_linux_function_app" "SSPHP_rust" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY" = (sensitive value)
            # (4 unchanged elements hidden)
        }
        id                                             = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-p3sha"
        name                                           = "SSPHP-Metrics-rust-p3sha"
      ~ tags                                           = {
            "Environment"                                    = "Dev"
            "Product"                                        = "Protective Monitoring - Splunk SaaS"
            "Service Offering"                               = "Protective Monitoring - Splunk SaaS"
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=fa7ff01b-8fda-41c2-ac15-c616a7d6e4d4;IngestionEndpoint=https://westeurope-2.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=042c0014-747c-4927-be3b-74cbf748f850" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "fa7ff01b-8fda-41c2-ac15-c616a7d6e4d4" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/microsoft.insights/components/SSPHP-Metrics" -> null
        }
      ~ zip_deploy_file                                = "../data_ingester/data_ingester_rust_20241015102633.zip" -> (known after apply)
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

ghadelimiter_2ed1518f-7dc2-487b-8ba9-026440664981
stderr<<ghadelimiter_7bfed89d-8a34-4767-8ebb-b7665903303e

ghadelimiter_7bfed89d-8a34-4767-8ebb-b7665903303e
exitcode<<ghadelimiter_9f26fe45-a48d-4efa-b351-1a5ede456db9
0
ghadelimiter_9f26fe45-a48d-4efa-b351-1a5ede456db9
```